Учебная/src/DataProcessors/РабочийСтол/РабочийСтол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочийСтол</name>
</mdclass:DataProcessor>

Учебная/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учебная/src/DataProcessors/РабочийСтол/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущаяДата = ТекущаяДата();
КонецПроцедуры


&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Курс = ПолучитьКурсВалют (Валюта);
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКурсВалют(Валюта)
	Структура = Новый Структура;
	Структура.Вставить("Валюта", Валюта);
	
	Последнее = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекущаяДата(), Структура);
	
	Возврат Последнее.Курс;


КонецФункции // ПолучитьКурсВалют()
